app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2009-10-20 11:46:01', 'je suis pas pres de m arrtŕ Damn!', '2009-10-20 11:46:01', 3, 'Iam')
---
  def create
    @post = Post.find(params[:post_id])
    @comment=@post.comments.new(params[:comment])

    if @comment.save