app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-10-20 08:38:40', 'Fine', 'A fine is money paid usually to superior authority, usually governmenal authority, as punishment for a crime or other offence.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "updated_at" = '2009-10-21 07:14:58', "title" = 'let me be', "body" = 'stargarge how thngs in life ...difinition of things that are not related and wil be related at some points or will never be ...i dont have the power to control my surundings even i am master of myself' WHERE "id" = 4
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])