app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "email") VALUES('98fa5b0326c38899fd27da3daa176db6d13a4a8ab38132a24521ba8215b58281', '2009-10-22 08:43:37', '2009-10-22 08:43:37', '39908273a8378fc35531b3baa8d85933c9dd5935c0e3de03969214e2216bee6b', 'games@games.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save